<?php
echo 1;
echo 2;
echo 3;
?>

<!DOCTYPE html>
<html>
	<head>
		<title>Резюме Мазур М.В.</title>
		<meta charset='utf-8'>
		<link rel='stylesheet' href='style.css'>
	</head>
	<body>
		<p> <img src='bb.jpeg' align='right' border='2' alt='фото резюме'></p>
		<center><h1>Мазур Максим Валериевич</h1></center>
		<center><h4>Год рождения: 1982</h4></center>
		<h3>ОСНОВНАЯ СПЕЦИАЛИЗАЦИЯ И НАВЫКИ </h3>
		<hr>
		<dl>
			<dt> <em><strong>Разработка проектной документации по направлениях :</strong></em> </dt>
				<dd>
				<ul>
				<li>проектирование систем охранной сигнализации (объектовая и периметральная ОС, системы контроля <br>
					и управления доступом, тревожная сигнализация);</li>
				<li>проектирование систем охранного телевидения (интегрирование с ОС);</li>
				<li>проектирование телефонизации, радиофикации, производственно-технологической связи, ЛВС;</li>
				<li>проектирование систем пожарной сигнализации и пожаротушения.</li>

				</ul>
				</dd>

		</dl>
		<h3>ОБРАЗОВАНИЕ</h3>
		<hr>
		<dl>
			<dt><em><strong> 2000-2006 г.г., г.Киев, Украина :</strong></em> </dt>
				<dd>
					<ul>
						<li><a href='http://kpi.ua/ru/'>Национальный технический университет Украины «КПИ».</a><!--"это
						 моя первая ссылка (открывает в этой же вкладке)"--> Специальность: Электромеханические системы
<br> автоматизации и электропривод. Квалификация:  инженер-электромеханик.</li>
					</ul>
				</dd>
			<dt><em><strong>2017 г. - по сегодняшний день, г.Киев, Украина:</strong></em> </dt>
				<dd>
					<ul>
						<li><a href='http://php-academy.kiev.ua/' title='в php-academy очень весело и интересно;)'
							   target='_blank'>PHP Academy</a>
							<!--"это моя вторая ссылка (открывает в новой вкладке)"--> Специальность:
							PHP разработчик </li>
					</ul>
				</dd>
		</dl>
		<h3>РАЗРАБАТЫВАЕМЫЕ ОБЪЕКТЫ</h3>
		<hr>
			<table align='center' cellpadding='5'' border='1' width='600'>
			 	<tr bgcolor='#cecdf2' >
<th>Год</th>
    				<th>Название объекта</th>
    				<th>Описание работ</th>
    			</tr>
            	<tr align='center'><td>2001</td><td><a href='https://www.annpz.ru/' target='_blank'>НПЗ «Антипинский»</a></td><td align='justify'>Объектовая и периметральная охранная сигнализация, СКУД, видеонаблюдение, связь и радиофикация, пожаротушение</td></tr>

    			<tr align='center'><td>2007</td><td><a href='https://mnpz.by/' target='_blank'>НПЗ «Мозырский»</a></td><td align='justify'>Объектовая охранная сигнализация, локальная вычислительная сеть</td></tr>

    			<tr align='center'><td>2012</td><td><a href='https://mnpz.by/' target='_blank'>ЗАО «Восточная нефтехимическая компания» »</a></td><td align='justify'>Периметральная охранная сигнализация, периметр площадки 2500 м, объектовая охранная сигнализация 30 зданий и сооружений, СКУД, видеонаблюдение, связь и радиофикация, оповещение, внутриплощадочные сети, пожарная сигнализация</td></tr>
   			</table>
		<br>
		<br>

		<marquee behavior="alternate" direction="left" bgcolor="#f0f0f0"><a href='#top' title='Перейти вверх;)'>На верх</a>
		</marquee>

		<p> &#169 2017 Максим Мазур, по всем вопросам пишите по адресу ambrucio@gmail.com /&#160;<a href='http://facebook.com' target='_blank'><img src='F.png' width="15" height="15"></p>
	</body>

</html>