<!DOCTYPE html>
<head>
    <meta charset="UTF-8">
    <title>Задачи по массивам и циклам</title>
    <style>
            p {text-align: left;
            background: #faefa4;
            }
    </style>
</head>
<body>
    <p><a href='./1.php'>Task 1. Дан массив с элементами 'html', 'css', 'php', 'js', 'jq'. С помощью цикла foreach
      выведите эти слова в столбик </a></p>
    <p><a href='./2.php'>Task 2. Дан массив с элементами 1, 20, 15, 17, 24, 35. С помощью цикла foreach найдите сумму
        элементов этого массива. Запишите ее в переменную $result. </a></p>
    <p><a href='./3.php'>Task 3. Дан массив с элементами 26, 17, 136, 12, 79, 15. С помощью цикла foreach найдите сумму
        квадратов элементов этого массива. Результат запишите переменную $result. </a></p>

    <p><a href='./4.php'>Task 4. Дан массив $arr. С помощью первого цикла foreach выведите на экран столбец ключей, с
        помощью второго — столбец элементов. $arr = array('green'=>'зеленый', 'red'=>'красный','blue'=>'голубой'); </a></p>
    <p><a href='./5.php'>Task 5. Дан массив $arr с ключами 'Коля', 'Вася', 'Петя' с элементами '200', '300', '400'.
            С помощью цикла foreach выведите на экран столбец строк такого формата: 'Коля — зарплата 200
            долларов.' </a></p>
    <p><a href='./6.php'>Task 6. Дан массив $arr. С помощью цикла foreach запишите английские названия в массив $en, а
            русские — в массив $ru.
            $arr = array('green'=>'зеленый', 'red'=>'красный','blue'=>'голубой');
            $en = array('green', 'red','blue');
            $ru = array('зеленый', 'красный', 'голубой'); </a></p>
    <p><a href='./7.php'>Task 7. Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла foreach и оператора if
            выведите на экран столбец тех элементов массива, которые больше 3­х, но меньше 10.</p>
    <p><a href='./8.php'>Task 8. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла foreach создайте строку
        '­1­2­3­4­5­6­7­8­9­'. </a></p>
    <p><a href='./9.php'>Task 9. Выведите столбец чисел от 1 до 100. </a></p>
    <p><a href='./10.php'>Task 10. Выведите столбец чисел от 11 до 33. </a></p>
    <p><a href='./11.php'>Task 11. Выведите столбец четных чисел в промежутке от нуля до 100. </a></p>
    <p><a href='./12.php'>Task 12. Дано число $n = 1000. Делите его на 2 столько раз, пока результат деления не станет
            меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для
            этого (итерации — это количество проходов цикла), и запишите его в переменную $num. </a></p>
    <p><a href='./13.php'>Task 13. Вывести таблицу умножения. </a></p>










</body>