<!DOCTYPE html>
<head>
    <meta charset="UTF-8">
    <title>Задачи по массивам и циклам</title>
    <style>
            p {text-align: left;
            background: #fffbdc;
            }
    </style>
</head>
<body>
    <p><a href='./1.php'>Task 1. Дан массив с элементами 'html', 'css', 'php', 'js', 'jq'. С помощью цикла foreach
      выведите эти слова в столбик </a></p>
    <p><a href='./2.php'>Task 2. Дан массив с элементами 1, 20, 15, 17, 24, 35. С помощью цикла foreach найдите сумму
        элементов этого массива. Запишите ее в переменную $result. </a></p>
    <p><a href='./3.php'>Task 3. Дан массив с элементами 26, 17, 136, 12, 79, 15. С помощью цикла foreach найдите сумму
        квадратов элементов этого массива. Результат запишите переменную $result. </a></p>

    <p><a href='./4.php'>Task 4. Дан массив $arr. С помощью первого цикла foreach выведите на экран столбец ключей, с
        помощью второго — столбец элементов. $arr = array('green'=>'зеленый', 'red'=>'красный','blue'=>'голубой'); </a></p>
    <p><a href='./5.php'>Task 5. Дан массив $arr с ключами 'Коля', 'Вася', 'Петя' с элементами '200', '300', '400'.
            С помощью цикла foreach выведите на экран столбец строк такого формата: 'Коля — зарплата 200
            долларов.' </a></p>
    <p><a href='./6.php'>Task 6. Дан массив $arr. С помощью цикла foreach запишите английские названия в массив $en, а
            русские — в массив $ru.
            $arr = array('green'=>'зеленый', 'red'=>'красный','blue'=>'голубой');
            $en = array('green', 'red','blue');
            $ru = array('зеленый', 'красный', 'голубой'); </a></p>
    <p><a href='./7.php'>Task 7. Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла foreach и оператора if
            выведите на экран столбец тех элементов массива, которые больше 3­х, но меньше 10.</p>
    <p><a href='./8.php'>Task 8. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла foreach создайте строку
        '­1­2­3­4­5­6­7­8­9­'. </a></p>
    <p><a href='./9.php'>Task 9. Выведите столбец чисел от 1 до 100. </a></p>
    <p><a href='./10.php'>Task 10. Выведите столбец чисел от 11 до 33. </a></p>
    <p><a href='./11.php'>Task 11. Выведите столбец четных чисел в промежутке от нуля до 100. </a></p>
    <p><a href='./12.php'>Task 12. Дано число $n = 1000. Делите его на 2 столько раз, пока результат деления не станет
            меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для
            этого (итерации — это количество проходов цикла), и запишите его в переменную $num. </a></p>
    <p><a href='./13.php'>Task 13. Вывести таблицу умножения. </a></p>
    <p><a href='./14.php'>Task 14. Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. С помощью цикла foreach и оператора if
            проверьте есть ли в массиве элемент со значением $e, равном 2, 3 или 4. Если есть —
            выведите на экран 'Есть!', иначе выведите 'Нет!' </a></p>
    <p><a href='./15.php'>Task 15. Дан массив $arr. С помощью цикла foreach и переменной $count подсчитайте количество
            элементов этого массива. Проверьте работу скрипта на примере массива с элементами 4, 2,
            5, 19, 13, 0, 10. </a></p>
    <p><a href='./16.php'>Task 16. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла foreach и оператора if
            выведите на экран столбец элементов массива, как показано на картинке.
            1, 2, 3
            4, 5, 6
            7, 8, 9 </a></p>
    <p><a href='./17.php'>Task 17. Составьте массив месяцев. С помощью цикла foreach выведите все месяцы, а текущий
            месяц выведите жирным. Текущий месяц должен храниться в переменной $month. </a></p>
    <p><a href='./18.php'>Task 18. Составьте массив дней недели. С помощью цикла foreach выведите все дни недели,
            выходные дни следует вывести жирным. </a></p>
    <p><a href='./19.php'>Task 19. Составьте массив дней недели. С помощью цикла foreach выведите все дни недели, а
            текущий день выведите курсивом. Текущий день должен храниться в переменной $day. </a></p>

    <p><a href='./20.php'>Task 20. Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20
            рядов, а не 5.<br><br>
            x<br>
            xx<br>
            xxx<br>
            xxxx<br>
            xxxxx</p> </a></p>
    <p><a href='./21.php'>Task 21. Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 9
            рядов, а не 5.<br><br>
            1<br>
            22<br>
            333<br>
            4444<br>
            55555</p>  </a></p>
    <p><a href='./22.php'>Task 22. Нарисуйте пирамиду, как показано на рисунке, воспользовавшись циклом for или while.<br><br>
            xx<br>
            xxxx<br>
            xxxxxx<br>
            xxxxxxxx<br>
            xxxxxxxxxx</p>  </a></p>
    <p><a href='./23.php'>Task 23. Вам нужно разработать программу, которая считала бы сумму цифр числа введенного
            пользователем. Например: есть число 123, то программа должна вычислить сумму цифр 1,
            2, 3, т. е. 6.  </a></p>
    <p><a href='./24.php'>Task 24. Вам нужно разработать программу, которая считала бы количество вхождений
            какой­нибуть выбранной вами цифры в выбранном вами числе. Например: цифра 5 в числе
            442158755745 встречается 4 раза.  </a></p>
    <p><a href='./25.php'>Task 25. Ваше задание создать массив, наполнить это случайными значениями (функция rand),
            найти максимальное и минимальное значение и поменять их местами </a></p>
    <p><a href='./26.php'>Task 26. Вам нужно создать массив и заполнить его случайными числами от 1 до 100 (ф­я rand).
            Далее, вычислить произведение тех элементов, которые больше ноля и у которых парные
            индексы. После вывести на экран элементы, которые больше ноля и у которых не парный
            индекс. </a></p>
    <p><a href='./27.php'>Task 27.Создать генератор случайных таблиц. Есть переменные: $rows - кол-во строк в таблице,
            $cols - кол-во столбцов в таблице. Есть список цветов, в массиве: $colors = array('red','yellow','blue',
            'gray','maroon','brown','green'). Необходимо создать скрипт, который по заданным условиям выведет таблицу
            размера $rows на $cols, в которой все ячейки будут иметь цвета, выбранные случайным образом из массива
            $colors. В каждой ячейке должно находиться случайное число. <br><br>

            Пример результата:<br>

            <table><tr><td style='background-color:blue'>2033</td><td style='background-color:brown'>11696</td>
                    <td style='background-color:green'>712</td><td style='background-color:yellow'>32583</td>
                    <td style='background-color:red'>157</td></tr><tr><td style='background-color:gray'>25694</td>
                    <td style='background-color:red'>19724</td><td style='background-color:brown'>18487</td>
                    <td style='background-color:brown'>8462</td><td style='background-color:red'>4412</td></tr><tr>
                    <td style='background-color:gray'>4673</td><td style='background-color:gray'>14450</td>
                    <td style='background-color:maroon'>16748</td><td style='background-color:gray'>3505</td>
                    <td style='background-color:maroon'>5299</td></tr><tr><td style='background-color:red'>16873</td>
                    <td style='background-color:gray'>21370</td><td style='background-color:green'>22482</td>
                    <td style='background-color:red'>28576</td><td style='background-color:blue'>26060</td></tr><tr>
                    <td style='background-color:yellow'>28955</td><td style='background-color:gray'>8804</td>
                    <td style='background-color:gray'>26825</td><td style='background-color:red'>31471</td>
                    <td style='background-color:blue'>22283</td></tr></table> </a></p>

    <p><a href='./28.php'>Task 28. Вывести таблицу умножения с помощью двух циклов for </a></p>





</body>